:PROPERTIES:
:ID:       70bdc644-aa9c-4b05-88f7-9c4e5cbe9f3e
:END:
#+TITLE: Directed random walk
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope nil :emphasize nil
#+CAPTION: Clock summary at [2024-04-12 Fri 18:41]
| Headline                 | Time   |
|--------------------------+--------|
| *Total time*             | *0:55* |
|--------------------------+--------|
| 2.2 Directed random walk | 0:55   |
#+END
* 2.2 Directed random walk
:LOGBOOK:
CLOCK: [2024-04-12 Fri 17:22]--[2024-04-12 Fri 18:17] =>  0:55
:END:
*The motion of a particle in three dimensions is a series of independent steps of length* \(l\). *Each step makes an angle* \( \theta \) *with the* \(z\) *axis, with a probability density* \( p(\theta) = 2 \cos^2(\theta/2) / \pi; \) *while the angle* \( \phi \) *is uniformly distributed between* \(0\) *and* \( 2\pi \). *(Note that the solid angle factor of* \( \sin \theta \) *is already included in the definition of* \( p(\theta) \), *which is correctly normalized to unity.) The particle (walker) starts at the origin and makes a large number of steps* \( N \).
** 2.2.1 
*Calculate the expectation values* \(\langle z \rangle\), \(\langle x \rangle\), \(\langle y \rangle\), \(\langle z^2 \rangle\), \(\langle x^2 \rangle\), *and* \(\langle y^2 \rangle\), *and the covariances* \(\langle xy \rangle\), \(\langle xz \rangle\), *and* \(\langle yz \rangle\).

\begin{aligned}
\langle z\rangle & =\sum_{i=1}^N\left\langle z_i\right\rangle=N\left\langle z_i\right\rangle=N \ell\left\langle\cos \theta_i\right\rangle \\
& =N l \int_0^\pi \cos \theta\left(2 \cos ^2(\theta / 2) / \pi\right) d \theta=\frac{N l}{\pi} \int_0^\pi \cos \theta[\cos \theta+1] d t \\
& =\frac{N l}{\pi} \int_0^\pi\left(\cos ^2 \theta+\cos \theta\right) d \theta=\frac{N l}{\pi} \int_0^\pi \frac{\cos (2 \theta)+1}{2} d \theta \\
& =\frac{N l}{\pi}\left[\frac{1}{2} \pi+0\right]=\frac{N \ell}{2}
\end{aligned}


Unlike \(z\), \(\langle x\rangle=\langle y\rangle=0\), since there's no directional bias. Moving on to the variances, we have


\begin{align*}
\langle x^2 \rangle & =\sum_{i, j} \langle x_i x_j \rangle=\sum_i \sum_{i \neq j} \langle x_i \rangle \langle x_j \rangle+\sum_{i=j} \langle x_i^2 \rangle = N \langle x_i^2 \rangle,
\end{align*}

\begin{align*}
\langle y^2 \rangle & =\sum_{i, j} \langle y_i y_j \rangle=\sum_i \sum_{i \neq j} \langle y_i \rangle \langle y_j \rangle+\sum_{i=j} \langle y_i^2 \rangle = N \langle y_i^2 \rangle,
\end{align*}

and

\begin{aligned}
\langle z^2\rangle & =\sum \langle z_i z_j \rangle=\sum_{i, j} \langle z_i z_j \rangle=\sum_i \sum_{i \neq j} \langle z_i z_j \rangle \\
& =\sum_{i=j} \sum_{i \neq j} \langle z_i \rangle \langle z_j \rangle+\sum_i \langle z_i^2 \rangle \\
& =N(N-1)\left(\frac{l}{2}\right)^2+N \langle z_i^2 \rangle.
\end{aligned}

Since

\begin{aligned}
\langle x_i^2\rangle &= l^2\langle\sin ^2 \theta \cos ^2 \phi\rangle=\frac{l^2}{2} \int_0^\pi \frac{\sin ^2 \theta(\cos \theta+1)}{\pi} d \theta \thinspace \int_0^{2 \pi} \frac{\cos (2 \phi)+1}{2 \pi} d \phi \\
&=l^2 / 4,
\end{aligned}

\begin{aligned}
\langle y_i^2\rangle = \langle x_i^2\rangle = l^2 / 4,
\end{aligned}

and

\begin{align*}
\langle z_i^2 \rangle & =l^2 \langle\cos ^2 \theta_i \rangle=l^2 \int_0^\pi \cos ^2 \theta\left[2 \cos ^2\left(\frac{\theta}{2}\right) / \pi\right] d \theta \\
& =l^2 \int_0^\pi \frac{\cos ^2 \theta(\cos \theta+1) d \theta}{\pi} \\
& =\frac{l^2}{2} \int_0^\pi \frac{(\cos (2 \theta)+1)}{\pi} d \theta=l^2 / 2,
\end{align*}

we have \(\langle x^{2} \rangle = N l^{2} / 4\), \(\langle y^{2} \rangle = N l^{2} / 4\), and  \(\langle z^2\rangle = N(N+1) (l/2)^2\). As for the covariances, they all vanish: even though there is a directional bias along \(z\), it appears with other variables in covariances, which are equally probable to be positive or negative; we therefore have \(\langle x y \rangle\), \(\langle y z \rangle\), and \(\langle z x \rangle\).
** 2.2.2 
*Use the central limit theorem to estimate the probability density* \(p(x, y, z)\) *for the particle to end up at the point* \((x, y, z)\).

By appeal to [[id:345593a9-547f-4a22-869d-7963ab81054a][Central limit theorem]], \(p(x, y, z)\) is a multivariate Gaussian, i.e., all cumulants \(>2\) vanish as \(N \rightarrow \infty\). The matrix of covariances \(C\) is:

\begin{align*}
\left[\begin{array}{ccc}
\left\langle x^2\right\rangle_c & 0 & 0 \\
0 & \left\langle y^2\right\rangle_c & 0 \\
0 & 0 & \left\langle z^2\right\rangle_c
\end{array}\right]
\end{align*}

The cumulants are easily obtained from the moments: \(\langle x^2\rangle_c & =\langle y^2\rangle_c=\langle x^2\rangle=\langle y^2\rangle= N (l/2)^{2}\), and \(\langle z^2\rangle_c =\langle z^2\rangle-\langle z\rangle^2 = N (l / 2)^{2}\). The probability density \(p(x, y, z)\) is thus

\begin{align*}
p(x,\, y,\, z) = \left(\frac{2}{\pi N l^2}\right)^{3 / 2} \exp \left[-\frac{x^2+y^2+(z-N l / 2)^2}{N l^{2} / 2}\right] = p(x\,\vert\, y,\, z) p(y,\, z) = p(x\,\vert\, y,\, z) p(y\,\vert\, z) p(z) = p(x) p(y) p(z).
\end{align*}

In the final step, we have used the fact that steps along a given direction is independent of the steps along a different direction. This is not true in general, it merely happens to be the case because of the structure of the covariance matrix \(C\). The probability densities along each of the directions are easily isolated:

\begin{align*}
p(x) = \left(\frac{2}{\pi N l^2}\right)^{1 / 2} \exp \bigg(-\frac{x^2}{N l^{2} / 2}\bigg),
\end{align*}

\begin{align*}
p(y) = \left(\frac{2}{\pi N l^2}\right)^{1 / 2} \exp \bigg(-\frac{y^2}{N l^{2} / 2}\bigg),
\end{align*}

\begin{align*}
p(z) = \left(\frac{2}{\pi N l^2}\right)^{1 / 2} \exp \bigg(-\frac{(z-N l / 2)^2}{N l^{2} / 2}\bigg).
\end{align*}


